import { Link } from "react-router-dom";

const AboutPage = () => {

    console.log("RENDER AboutPage");
    return (
        <div className="page">
            <h1>Про додаток</h1>

            <p>
                Цей застосунок розроблений для роботи зі списком екзаменів. Його основне
                призначення — надати зручний спосіб перегляду, додавання та відкриття
                детальної інформації про кожен екзамен.
            </p>

            <p>
                У проєкті реалізовано кілька сторінок з використанням React Router:
                головна сторінка, сторінка списку, сторінка деталей, сторінка
                додавання, окрема сторінка списку на класовому компоненті, а також
                сторінка для невідомих маршрутів.
            </p>

            <p>
                Початкові дані винесені в окремий файл, усі основні змінні та props
                типізовані за допомогою TypeScript, а інтерфейс побудований так, щоб
                застосунок був простим, зрозумілим і зручним у використанні.
            </p>

            <div className="form-actions">
                <Link to="/" className="details-link">
                    Повернутися на головну
                </Link>
            </div>
        </div>
    );
};

export default AboutPage;